In [1]:
import pandas as pd
from flask import Flask
from flaskext.mysql import MySQL

In [2]:
app = Flask(__name__)
mysql = MySQL()
app.config['MYSQL_DATABASE_USER'] = 'root'
app.config['MYSQL_DATABASE_PASSWORD'] = ''
app.config['MYSQL_DATABASE_DB'] = 'db'
app.config['MYSQL_DATABASE_HOST'] = 'localhost'
db = mysql.init_app(app)

In [3]:
conn = mysql.connect()
cursor = conn.cursor()

cursor.execute("SELECT * from try")
data = cursor.fetchall()

In [4]:
data

(('Guilherme ', 'Thomaz', 15),
 ('Andre Filho', 'Schmidt', 21),
 ('Paulo Júnior', 'Gearhdt', 53),
 ('Julia', 'Maria', 25),
 ('Flora', 'Maria', 4),
 ('Miguel', 'Souza', 8),
 ('Augusto', 'Seixas', 33),
 ('Nome', 'Sobrenome', 0),
 ('Nome', 'Sobrenome', 0))

In [9]:
df = pd.read_sql('SELECT * FROM try', con = conn)

In [11]:
df = pd.DataFrame(data)

In [12]:
df

              0          1   2
0    Guilherme      Thomaz  15
1   Andre Filho    Schmidt  21
2  Paulo Júnior    Gearhdt  53
3         Julia      Maria  25
4         Flora      Maria   4
5        Miguel      Souza   8
6       Augusto     Seixas  33
7          Nome  Sobrenome   0
8          Nome  Sobrenome   0